Microchip-MPLAB-Harmony/wireless_wifi/driver/wincs02/nc_driver/include/microchip_pic32mzw2_nc_intf.h
/* Autogenerated file, do not edit */

#ifndef MICROCHIP_PIC32MZW2_NC_INTF_H
#define MICROCHIP_PIC32MZW2_NC_INTF_H

#define WINC_MOD_ID_CORE                                        (0x00U)
#define WINC_MOD_ID_SYSTEM                                      (0x01U)
#define WINC_MOD_ID_INTERNAL                                    (0x02U)
#define WINC_MOD_ID_CFG                                         (0x03U)
#define WINC_MOD_ID_DHCP                                        (0x04U)
#define WINC_MOD_ID_DNS                                         (0x05U)
#define WINC_MOD_ID_FS                                          (0x07U)
#define WINC_MOD_ID_MQTT                                        (0x08U)
#define WINC_MOD_ID_NETIF                                       (0x09U)
#define WINC_MOD_ID_OTA                                         (0x0aU)
#define WINC_MOD_ID_PING                                        (0x0bU)
#define WINC_MOD_ID_RST                                         (0x0cU)
#define WINC_MOD_ID_SNTP                                        (0x0dU)
#define WINC_MOD_ID_SOCKET                                      (0x0eU)
#define WINC_MOD_ID_TIME                                        (0x10U)
#define WINC_MOD_ID_TLS                                         (0x11U)
#define WINC_MOD_ID_WAP                                         (0x12U)
#define WINC_MOD_ID_WSCN                                        (0x13U)
#define WINC_MOD_ID_WSTA                                        (0x14U)
#define WINC_MOD_ID_ASSOC                                       (0x16U)
#define WINC_MOD_ID_SI                                          (0x17U)
#define WINC_MOD_ID_WPROV                                       (0x19U)
#define WINC_MOD_ID_DI                                          (0x1aU)
#define WINC_MOD_ID_EXTCRYPTO                                   (0x1bU)
#define WINC_MOD_ID_WIFI                                        (0x1cU)
#define WINC_MOD_ID_NVM                                         (0x1dU)

// WINC_STATUS_TYPE: 2 bytes: <MODULE_ID> | <MSG_ID>
#define WINC_STATUS_OK                                          (0x0000U)
#define WINC_STATUS_ERROR                                       (0x0001U)
#define WINC_STATUS_INVALID_CMD                                 (0x0002U)
#define WINC_STATUS_UNKNOWN_CMD                                 (0x0003U)
#define WINC_STATUS_INVALID_PARAMETER                           (0x0004U)
#define WINC_STATUS_INCORRECT_NUM_PARAMS                        (0x0005U)
#define WINC_STATUS_STORE_UPDATE_BLOCKED                        (0x0006U)
#define WINC_STATUS_STORE_ACCESS_FAILED                         (0x0007U)
#define WINC_STATUS_TIMEOUT                                     (0x0008U)
#define WINC_STATUS_HOST_INTERFACE_FAILED                       (0x0009U)
#define WINC_STATUS_ACCESS_DENIED                               (0x000aU)
#define WINC_STATUS_WIFI_API_REQUEST_FAILED                     (0x0100U)
#define WINC_STATUS_STA_NOT_CONNECTED                           (0x0101U)
#define WINC_STATUS_NETWORK_ERROR                               (0x0102U)
#define WINC_STATUS_FILE_SYSTEM_ERROR                           (0x0103U)
#define WINC_STATUS_CFG_NOT_PRESENT                             (0x0300U)
#define WINC_STATUS_DNS_TYPE_NOT_SUPPORTED                      (0x0500U)
#define WINC_STATUS_DNS_TIMEOUT                                 (0x0501U)
#define WINC_STATUS_DNS_ERROR                                   (0x0502U)
#define WINC_STATUS_TSFR_PROTOCOL_NOT_SUPPORTED                 (0x0700U)
#define WINC_STATUS_FILE_EXISTS                                 (0x0701U)
#define WINC_STATUS_FILE_NOT_FOUND                              (0x0702U)
#define WINC_STATUS_INVALID_FILE_TYPE                           (0x0703U)
#define WINC_STATUS_MQTT_ERROR                                  (0x0800U)
#define WINC_STATUS_NETWORK_INTF_DOWN                           (0x0900U)
#define WINC_STATUS_ERASE_DONE                                  (0x0a00U)
#define WINC_STATUS_WRITE_DONE                                  (0x0a01U)
#define WINC_STATUS_VERIFY_DONE                                 (0x0a02U)
#define WINC_STATUS_ACTIVATE_DONE                               (0x0a03U)
#define WINC_STATUS_INVALIDATE_DONE                             (0x0a04U)
#define WINC_STATUS_OTA_ERROR                                   (0x0a05U)
#define WINC_STATUS_OTA_NO_STA_CONN                             (0x0a06U)
#define WINC_STATUS_OTA_PROTOCOL_ERROR                          (0x0a07U)
#define WINC_STATUS_OTA_TLS_ERROR                               (0x0a08U)
#define WINC_STATUS_OTA_IMG_TOO_LARGE                           (0x0a09U)
#define WINC_STATUS_OTA_TIMEOUT                                 (0x0a0aU)
#define WINC_STATUS_OTA_VERIFY_FAILED                           (0x0a0bU)
#define WINC_STATUS_PING_FAILED                                 (0x0b00U)
#define WINC_STATUS_SNTP_SERVER_TMO                             (0x0d00U)
#define WINC_STATUS_SNTP_PROTOCOL_ERROR                         (0x0d01U)
#define WINC_STATUS_SOCKET_ID_NOT_FOUND                         (0x0e00U)
#define WINC_STATUS_LENGTH_MISMATCH                             (0x0e01U)
#define WINC_STATUS_NO_FREE_SOCKETS                             (0x0e02U)
#define WINC_STATUS_SOCKET_INVALID_PROTOCOL                     (0x0e03U)
#define WINC_STATUS_SOCKET_CLOSE_FAILED                         (0x0e04U)
#define WINC_STATUS_SOCKET_BIND_FAILED                          (0x0e05U)
#define WINC_STATUS_SOCKET_TLS_FAILED                           (0x0e06U)
#define WINC_STATUS_SOCKET_CONNECT_FAILED                       (0x0e07U)
#define WINC_STATUS_SOCKET_SEND_FAILED                          (0x0e08U)
#define WINC_STATUS_SOCKET_SET_OPT_FAILED                       (0x0e09U)
#define WINC_STATUS_SOCKET_REMOTE_NOT_SET                       (0x0e0aU)
#define WINC_STATUS_MULTICAST_ERROR                             (0x0e0bU)
#define WINC_STATUS_SOCKET_NOT_READY                            (0x0e0cU)
#define WINC_STATUS_SOCKET_SEQUENCE_ERROR                       (0x0e0dU)
#define WINC_STATUS_TIME_ERROR                                  (0x1000U)
#define WINC_STATUS_WAP_STOP_REFUSED                            (0x1200U)
#define WINC_STATUS_WAP_STOP_FAILED                             (0x1201U)
#define WINC_STATUS_WAP_START_REFUSED                           (0x1202U)
#define WINC_STATUS_WAP_START_FAILED                            (0x1203U)
#define WINC_STATUS_UNSUPPORTTED_SEC_TYPE                       (0x1204U)
#define WINC_STATUS_STA_DISCONN_REFUSED                         (0x1400U)
#define WINC_STATUS_STA_DISCONN_FAILED                          (0x1401U)
#define WINC_STATUS_STA_CONN_REFUSED                            (0x1402U)
#define WINC_STATUS_STA_CONN_FAILED                             (0x1403U)
#define WINC_STATUS_ASSOC_NOT_FOUND                             (0x1600U)

