Microchip-MPLAB-Harmony/wireless_wifi/driver/wincs02/nc_driver/include/microchip_pic32mzw2_nc_intf.h
// WINC_CMD_ID: 2 bytes: <MODULE_ID> | <CMD_ID>
#define WINC_CMD_ID_GMI                                         (0x0200U)
#define WINC_CMD_ID_GMM                                         (0x0201U)
#define WINC_CMD_ID_GMR                                         (0x0202U)
#define WINC_CMD_ID_IPR                                         (0x0203U)
#define WINC_CMD_ID_CFG                                         (0x0300U)
#define WINC_CMD_ID_CFGCP                                       (0x0301U)
#define WINC_CMD_ID_DHCPSC                                      (0x0400U)
#define WINC_CMD_ID_DNSC                                        (0x0500U)
#define WINC_CMD_ID_DNSRESOLV                                   (0x0501U)
#define WINC_CMD_ID_FS                                          (0x0700U)
#define WINC_CMD_ID_FSTSFR                                      (0x0701U)
#define WINC_CMD_ID_MQTTC                                       (0x0800U)
#define WINC_CMD_ID_MQTTCONN                                    (0x0801U)
#define WINC_CMD_ID_MQTTSUB                                     (0x0802U)
#define WINC_CMD_ID_MQTTSUBLST                                  (0x0803U)
#define WINC_CMD_ID_MQTTSUBRD                                   (0x0804U)
#define WINC_CMD_ID_MQTTUNSUB                                   (0x0805U)
#define WINC_CMD_ID_MQTTPUB                                     (0x0806U)
#define WINC_CMD_ID_MQTTLWT                                     (0x0807U)
#define WINC_CMD_ID_MQTTDISCONN                                 (0x0808U)
#define WINC_CMD_ID_MQTTPROPTX                                  (0x0809U)
#define WINC_CMD_ID_MQTTPROPRX                                  (0x080aU)
#define WINC_CMD_ID_MQTTPROPTXS                                 (0x080bU)
#define WINC_CMD_ID_NETIFC                                      (0x0900U)
#define WINC_CMD_ID_NETIFTX                                     (0x0901U)
#define WINC_CMD_ID_OTAC                                        (0x0a00U)
#define WINC_CMD_ID_OTADL                                       (0x0a01U)
#define WINC_CMD_ID_OTAVFY                                      (0x0a02U)
#define WINC_CMD_ID_OTAACT                                      (0x0a03U)
#define WINC_CMD_ID_OTAINV                                      (0x0a04U)
#define WINC_CMD_ID_PING                                        (0x0b00U)
#define WINC_CMD_ID_RST                                         (0x0c00U)
#define WINC_CMD_ID_SNTPC                                       (0x0d00U)
#define WINC_CMD_ID_SOCKO                                       (0x0e00U)
#define WINC_CMD_ID_SOCKBL                                      (0x0e01U)
#define WINC_CMD_ID_SOCKBR                                      (0x0e02U)
#define WINC_CMD_ID_SOCKBM                                      (0x0e03U)
#define WINC_CMD_ID_SOCKTLS                                     (0x0e04U)
#define WINC_CMD_ID_SOCKWR                                      (0x0e05U)
#define WINC_CMD_ID_SOCKWRTO                                    (0x0e06U)
#define WINC_CMD_ID_SOCKRD                                      (0x0e07U)
#define WINC_CMD_ID_SOCKRDBUF                                   (0x0e08U)
#define WINC_CMD_ID_SOCKCL                                      (0x0e09U)
#define WINC_CMD_ID_SOCKLST                                     (0x0e0aU)
#define WINC_CMD_ID_SOCKC                                       (0x0e0bU)
#define WINC_CMD_ID_TIME                                        (0x1000U)
#define WINC_CMD_ID_TLSC                                        (0x1100U)
#define WINC_CMD_ID_TLSCSC                                      (0x1101U)
#define WINC_CMD_ID_WAPC                                        (0x1200U)
#define WINC_CMD_ID_WAP                                         (0x1201U)
#define WINC_CMD_ID_WSCNC                                       (0x1300U)
#define WINC_CMD_ID_WSCN                                        (0x1301U)
#define WINC_CMD_ID_WSTAC                                       (0x1400U)
#define WINC_CMD_ID_WSTA                                        (0x1401U)
#define WINC_CMD_ID_ASSOC                                       (0x1600U)
#define WINC_CMD_ID_SI                                          (0x1700U)
#define WINC_CMD_ID_WPROVC                                      (0x1900U)
#define WINC_CMD_ID_WPROV                                       (0x1901U)
#define WINC_CMD_ID_DI                                          (0x1a00U)
#define WINC_CMD_ID_EXTCRYPTO                                   (0x1b00U)
#define WINC_CMD_ID_WIFIC                                       (0x1c00U)
#define WINC_CMD_ID_NVMC                                        (0x1d00U)
#define WINC_CMD_ID_NVMER                                       (0x1d01U)
#define WINC_CMD_ID_NVMWR                                       (0x1d02U)
#define WINC_CMD_ID_NVMCHK                                      (0x1d03U)
#define WINC_CMD_ID_NVMRD                                       (0x1d04U)

// WINC_AEC_ID: 2 bytes: <MODULE_ID> | <AEC_ID>
#define WINC_AEC_ID_BOOT                                        (0x0100U)
#define WINC_AEC_ID_DNSRESOLV                                   (0x0500U)
#define WINC_AEC_ID_DNSERR                                      (0x0501U)
#define WINC_AEC_ID_MQTTCONN                                    (0x0800U)
#define WINC_AEC_ID_MQTTCONNACK                                 (0x0801U)
#define WINC_AEC_ID_MQTTPUBACK                                  (0x0802U)
#define WINC_AEC_ID_MQTTPUBCOMP                                 (0x0803U)
#define WINC_AEC_ID_MQTTPUBERR                                  (0x0804U)
#define WINC_AEC_ID_MQTTSUB                                     (0x0805U)
#define WINC_AEC_ID_MQTTUNSUB                                   (0x0806U)
#define WINC_AEC_ID_MQTTSUBRX                                   (0x0807U)
#define WINC_AEC_ID_MQTTPROPRX                                  (0x0808U)
#define WINC_AEC_ID_NETIFRX                                     (0x0900U)
#define WINC_AEC_ID_OTA                                         (0x0a00U)
#define WINC_AEC_ID_OTAERR                                      (0x0a01U)
#define WINC_AEC_ID_PING                                        (0x0b00U)
#define WINC_AEC_ID_PINGERR                                     (0x0b01U)
#define WINC_AEC_ID_SNTPERR                                     (0x0d00U)
#define WINC_AEC_ID_SOCKIND                                     (0x0e00U)
#define WINC_AEC_ID_SOCKRXT                                     (0x0e01U)
#define WINC_AEC_ID_SOCKRXU                                     (0x0e02U)
#define WINC_AEC_ID_SOCKCL                                      (0x0e03U)
#define WINC_AEC_ID_SOCKTLS                                     (0x0e04U)
#define WINC_AEC_ID_SOCKERR                                     (0x0e05U)
#define WINC_AEC_ID_TIME                                        (0x1000U)
#define WINC_AEC_ID_WAPAIP                                      (0x1200U)
#define WINC_AEC_ID_WAPSC                                       (0x1201U)
#define WINC_AEC_ID_WAPSD                                       (0x1202U)
#define WINC_AEC_ID_WAPERR                                      (0x1203U)
#define WINC_AEC_ID_WSCNIND                                     (0x1300U)
#define WINC_AEC_ID_WSCNDONE                                    (0x1301U)
#define WINC_AEC_ID_WSTAAIP                                     (0x1400U)
#define WINC_AEC_ID_WSTALD                                      (0x1401U)
#define WINC_AEC_ID_WSTAERR                                     (0x1402U)
#define WINC_AEC_ID_WSTALU                                      (0x1403U)
#define WINC_AEC_ID_WSTAROAM                                    (0x1404U)
#define WINC_AEC_ID_ASSOC                                       (0x1600U)
#define WINC_AEC_ID_SIMSTAT                                     (0x1700U)
#define WINC_AEC_ID_SIMERR                                      (0x1701U)
#define WINC_AEC_ID_SIWPKTS                                     (0x1702U)
#define WINC_AEC_ID_SIHEAP                                      (0x1703U)
#define WINC_AEC_ID_SIHERR                                      (0x1704U)
#define WINC_AEC_ID_SISTACK                                     (0x1705U)
#define WINC_AEC_ID_WPROVAT                                     (0x1900U)
#define WINC_AEC_ID_WPROVDT                                     (0x1901U)
#define WINC_AEC_ID_EXTCRYPTO                                   (0x1b00U)
#define WINC_AEC_ID_NVMER                                       (0x1d00U)
#define WINC_AEC_ID_NVMCHK                                      (0x1d01U)
#define WINC_AEC_ID_NVMERR                                      (0x1d02U)

#define WINC_CONST_DNS_TYPE_A                                   (1U)
#define WINC_CONST_DNS_TYPE_AAAA                                (28U)
#define WINC_CONST_FS_OP_LOAD                                   (1U)
#define WINC_CONST_FS_OP_LIST                                   (2U)
#define WINC_CONST_FS_OP_DEL                                    (3U)
#define WINC_CONST_FS_OP_INFO                                   (4U)
#define WINC_CONST_FS_FILETYPE_CERT                             (1U)
#define WINC_CONST_FS_FILETYPE_PRIKEY                           (2U)
#define WINC_CONST_FS_FILETYPE_DHPARAM                          (3U)
#define WINC_CONST_FS_FILETYPE_CFG                              (20U)
#define WINC_CONST_FS_TSFRPROT_XMDM_CS                          (1U)
#define WINC_CONST_FS_TSFRPROT_XMDM_CRC                         (2U)
#define WINC_CONST_FS_TSFRPROT_XMDM_1K                          (3U)
#define WINC_CONST_FS_TSFRPROT_YMDM                             (4U)
#define WINC_CONST_FS_TSFRPROT_TSFR                             (5U)
#define WINC_CONST_MQTT_CLEAN_USE_EXIST                         (0U)
#define WINC_CONST_MQTT_CLEAN_USE_NEW                           (1U)
#define WINC_CONST_MQTT_MAX_QOS_QOS0                            (0U)
#define WINC_CONST_MQTT_MAX_QOS_QOS1                            (1U)
#define WINC_CONST_MQTT_MAX_QOS_QOS2                            (2U)
#define WINC_CONST_MQTT_DUP_NEW_MSG                             (0U)
#define WINC_CONST_MQTT_DUP_DUP_MSG                             (1U)
#define WINC_CONST_MQTT_RETAIN_NOT_RETAINED                     (0U)
#define WINC_CONST_MQTT_RETAIN_RETAINGED                        (1U)
#define WINC_CONST_MQTT_QOS_QOS0                                (0U)
#define WINC_CONST_MQTT_QOS_QOS1                                (1U)
#define WINC_CONST_MQTT_QOS_QOS2                                (2U)
#define WINC_CONST_MQTT_REASON_CODE_NORMAL                      (0U)
#define WINC_CONST_MQTT_REASON_CODE_SEND_LWT                    (4U)
#define WINC_CONST_MQTT_REASON_CODE_ERROR                       (128U)
#define WINC_CONST_MQTT_REASON_CODE_MALFORM_PKT                 (129U)
#define WINC_CONST_MQTT_REASON_CODE_PROT_ERR                    (130U)
#define WINC_CONST_MQTT_REASON_CODE_IMP_SPEC_ERR                (131U)
#define WINC_CONST_MQTT_REASON_CODE_TOP_INVALID                 (144U)
#define WINC_CONST_MQTT_REASON_CODE_RX_MAX_EXCEED               (147U)
#define WINC_CONST_MQTT_REASON_CODE_TOP_ALIAS_INVALID           (148U)
#define WINC_CONST_MQTT_REASON_CODE_PKT_TOO_LARGE               (149U)
#define WINC_CONST_MQTT_REASON_CODE_MSG_RATE_TOO_HIGH           (150U)
#define WINC_CONST_MQTT_REASON_CODE_QUOTA_EXCEED                (151U)
#define WINC_CONST_MQTT_REASON_CODE_ADMIN_ACT                   (152U)
#define WINC_CONST_MQTT_REASON_CODE_PAYLOAD_INVALID             (153U)
#define WINC_CONST_MQTT_PROP_ID_ALL                             (0U)
#define WINC_CONST_MQTT_PROP_ID_PAYLOAD_FORMAT_IND              (1U)
#define WINC_CONST_MQTT_PROP_ID_MSG_EXPIRY_INTERVAL             (2U)
#define WINC_CONST_MQTT_PROP_ID_CONTENT_TYPE                    (3U)
#define WINC_CONST_MQTT_PROP_ID_RESP_TOPIC                      (8U)
#define WINC_CONST_MQTT_PROP_ID_CORRELATION_DATA                (9U)
#define WINC_CONST_MQTT_PROP_ID_SUBSCRIPTION_ID                 (11U)
#define WINC_CONST_MQTT_PROP_ID_SESSION_EXPIRY_INTERVAL         (17U)
#define WINC_CONST_MQTT_PROP_ID_REQ_PROB_INFO                   (23U)
#define WINC_CONST_MQTT_PROP_ID_WILL_DELAY_INTERVAL             (24U)
#define WINC_CONST_MQTT_PROP_ID_REQ_RESP_INFO                   (25U)
#define WINC_CONST_MQTT_PROP_ID_REASON_STR                      (31U)
#define WINC_CONST_MQTT_PROP_ID_RECEIVE_MAX                     (33U)
#define WINC_CONST_MQTT_PROP_ID_TOPIC_ALIAS_MAX                 (34U)
#define WINC_CONST_MQTT_PROP_ID_TOPIC_ALIAS                     (35U)
#define WINC_CONST_MQTT_PROP_ID_USER_PROP                       (38U)
#define WINC_CONST_MQTT_PROP_ID_MAX_PACKET_SZ                   (39U)
#define WINC_CONST_MQTT_PROP_SEL_PROP_NOT_SEL                   (0U)
#define WINC_CONST_MQTT_PROP_SEL_PROP_SEL                       (1U)
#define WINC_CONST_MQTT_CONN_STATE_NOT_CONNECTED                (0U)
#define WINC_CONST_MQTT_CONN_STATE_CONNECTED                    (1U)
#define WINC_CONST_MQTT_CONNACK_FLAGS_NO_SESSION                (0U)
#define WINC_CONST_MQTT_CONNACK_FLAGS_SESSION_PRESENT           (1U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_SUCCESS                (0U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_ERROR                  (128U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_MALFORM_PKT            (129U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_PROT_ERR               (130U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_IMP_SPEC_ERR           (131U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_PROT_NA                (132U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_INVALID_CLIENT_ID      (133U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_BAD_USER_PASS          (134U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_NOT_AUTH               (135U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_SRV_NA                 (136U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_SRV_BUSY               (137U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_BANNED                 (138U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_BAD_AUTH               (140U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_TOP_INVALID            (144U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_PKT_TOO_LARGE          (149U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_QUOTA_EXCEED           (151U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_PAYLOAD_INVALID        (153U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_RETAIN_NA              (154U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_QOS_NA                 (155U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_USE_DIFF_SRV           (156U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_SRV_MOVED              (156U)
#define WINC_CONST_MQTT_CONN_REASON_CODE_CONN_RATE_EXCEED       (159U)
#define WINC_CONST_MQTT_REASON_CODE_QOS0_GRANTED                (0U)
#define WINC_CONST_MQTT_REASON_CODE_QOS1_GRANTED                (1U)
#define WINC_CONST_MQTT_REASON_CODE_QOS2_GRANTED                (2U)
#define WINC_CONST_MQTT_REASON_CODE_NOT_AUTH                    (135U)
#define WINC_CONST_MQTT_REASON_CODE_TOP_FILT_INVALID            (143U)
#define WINC_CONST_MQTT_REASON_CODE_PKT_ID_IN_USE               (145U)
#define WINC_CONST_MQTT_REASON_CODE_SHARED_SUB_NOT_SUP          (158U)
#define WINC_CONST_MQTT_REASON_CODE_SUB_IDENT_NA                (161U)
#define WINC_CONST_MQTT_REASON_CODE_WILDCARD_SUB_NA             (162U)
#define WINC_CONST_MQTT_RESULT_SUCCESS                          (0U)
#define WINC_CONST_MQTT_RESULT_NO_SUB                           (15U)
#define WINC_CONST_MQTT_RESULT_ERROR                            (128U)
#define WINC_CONST_MQTT_RESULT_IMP_SPEC_ERR                     (131U)
#define WINC_CONST_MQTT_RESULT_NOT_AUTH                         (135U)
#define WINC_CONST_MQTT_RESULT_TOP_FILT_INVALID                 (143U)
#define WINC_CONST_MQTT_RESULT_PKT_ID_IN_USE                    (145U)
#define WINC_CONST_MQTT_RETAIN_RETAINED                         (1U)
#define WINC_CONST_MQTT_PROP_SEL_NOT_SELECTED                   (0U)
#define WINC_CONST_MQTT_PROP_SEL_SELECTED                       (1U)
#define WINC_CONST_NETIF_PROTOCOL_VERSION_IPV4                  (4U)
#define WINC_CONST_NETIF_PROTOCOL_VERSION_IPV6                  (6U)
#define WINC_CONST_OTA_STATE_ENABLE                             (1U)
#define WINC_CONST_SOCKET_PROTOCOL_UDP                          (1U)
#define WINC_CONST_SOCKET_PROTOCOL_TCP                          (2U)
#define WINC_CONST_SOCKET_OUTPUT_MODE_ASCII                     (1U)
#define WINC_CONST_SOCKET_OUTPUT_MODE_BINARY                    (2U)
#define WINC_CONST_SOCKET_OUTPUT_MODE_ASCII_EXT                 (3U)
#define WINC_CONST_TIME_FORMAT_UTC_UNIX                         (1U)
#define WINC_CONST_TIME_FORMAT_UTC_NTP                          (2U)
#define WINC_CONST_TIME_FORMAT_RFC3339                          (3U)
#define WINC_CONST_WAP_STATE_DISABLE                            (0U)
#define WINC_CONST_WAP_STATE_ENABLE                             (1U)
#define WINC_CONST_WAP_STATE_DISABLED                           (0U)
#define WINC_CONST_WAP_STATE_ENABLED                            (1U)
#define WINC_CONST_WSCN_ACT_PASV_PASSIVE                        (0U)
#define WINC_CONST_WSCN_ACT_PASV_ACTIVE                         (1U)
#define WINC_CONST_WSCN_SEC_TYPE_NA                             (-1)
#define WINC_CONST_WSCN_SEC_TYPE_OPEN                           (0)
#define WINC_CONST_WSCN_SEC_TYPE_WPA2_PER_MM                    (2)
#define WINC_CONST_WSCN_SEC_TYPE_WPA2_PER                       (3)
#define WINC_CONST_WSCN_SEC_TYPE_WPA3_PER_TM                    (4)
#define WINC_CONST_WSCN_SEC_TYPE_WPA3_PER                       (5)
#define WINC_CONST_WSCN_SEC_TYPE_WPA2_ENT_MM                    (6)
#define WINC_CONST_WSCN_SEC_TYPE_WPA2_ENT                       (7)
#define WINC_CONST_WSCN_SEC_TYPE_WPA3_ENT_TM                    (8)
#define WINC_CONST_WSCN_SEC_TYPE_WPA3_ENT                       (9)
#define WINC_CONST_WSTA_STATE_DISABLE                           (0U)
#define WINC_CONST_WSTA_STATE_ENABLE                            (1U)
#define WINC_CONST_WSTA_STATE_NOT_CONNECTED                     (0U)
#define WINC_CONST_WSTA_STATE_CONNECTED                         (1U)
#define WINC_CONST_ASSOC_AP_STA_AP                              (0U)
#define WINC_CONST_ASSOC_AP_STA_STA                             (1U)
#define WINC_CONST_SI_FILTER_WIFI_MEM_ALLOC                     (0x01U)
#define WINC_CONST_SI_FILTER_WIFI_PKTS                          (0x02U)
#define WINC_CONST_SI_FILTER_HEAP_ALLOC                         (0x04U)
#define WINC_CONST_SI_FILTER_STACK_USAGE                        (0x08U)
#define WINC_CONST_SI_TYPE_MEM                                  (0U)
#define WINC_CONST_SI_TYPE_CFG                                  (1U)
#define WINC_CONST_SI_TYPE_HPTX                                 (2U)
#define WINC_CONST_SI_TYPE_HPRX                                 (3U)
#define WINC_CONST_SI_TYPE_NRMTX                                (4U)
#define WINC_CONST_SI_TYPE_NRMRX                                (5U)
#define WINC_CONST_WPROV_STATE_DISABLE                          (0U)
#define WINC_CONST_WPROV_STATE_ENABLE                           (1U)
#define WINC_CONST_EXTCRYPTO_STATUS_SUCCESS                     (0U)
#define WINC_CONST_EXTCRYPTO_STATUS_FAILURE                     (1U)
#define WINC_CONST_EXTCRYPTO_OP_TYPE_SIGN                       (1U)
#define WINC_CONST_EXTCRYPTO_OP_SOURCE_TYPE_TLSC                (1U)
#define WINC_CONST_EXTCRYPTO_SIGN_TYPE_ECDSA                    (1U)
#define WINC_CONST_EXTCRYPTO_CURVE_SECP256R1                    (1U)
#define WINC_CONST_EXTCRYPTO_CURVE_SECP384R1                    (2U)
#define WINC_CONST_EXTCRYPTO_CURVE_SECP521R1                    (3U)
#define WINC_CONST_NVM_CHECK_MODE_CRC16                         (2U)
#define WINC_CONST_NVM_CHECK_MODE_SHA                           (10U)
#define WINC_CONST_NVM_CHECK_MODE_SHA256                        (11U)
#define WINC_CONST_NVM_CHECK_MODE_SHA224                        (12U)
#define WINC_CONST_NVM_CHECK_MODE_SHA512                        (13U)
#define WINC_CONST_NVM_CHECK_MODE_SHA384                        (14U)

