Microchip-MPLAB-Harmony/wireless_wifi/driver/wincs02/nc_driver/include/microchip_pic32mzw2_nc_intf.h
#define WINC_CMD_PARAM_MIN_INTERNAL_BAUD_RATE                   (1U)
#define WINC_CMD_PARAM_MAX_INTERNAL_BAUD_RATE                   (4294967295U)
#define WINC_CMD_PARAM_MIN_DHCP_IDX                             (0U)
#define WINC_CMD_PARAM_MAX_DHCP_IDX                             (0U)
#define WINC_CMD_PARAM_MIN_FS_FILELENGTH                        (1U)
#define WINC_CMD_PARAM_MAX_FS_FILELENGTH                        (65535U)
#define WINC_CMD_PARAM_MIN_FS_TSFR_HANDLE                       (1U)
#define WINC_CMD_PARAM_MAX_FS_TSFR_HANDLE                       (65535U)
#define WINC_CMD_PARAM_MIN_FS_BLOCK_NUM                         (1U)
#define WINC_CMD_PARAM_MAX_FS_BLOCK_NUM                         (255U)
#define WINC_CMD_PARAM_MIN_FS_CRC                               (0U)
#define WINC_CMD_PARAM_MAX_FS_CRC                               (65535U)
#define WINC_CMD_PARAM_MIN_FS_FREE_SPACE                        (1U)
#define WINC_CMD_PARAM_MAX_FS_FREE_SPACE                        (65535U)
#define WINC_CMD_PARAM_MIN_FS_FREE_HANDLES                      (1U)
#define WINC_CMD_PARAM_MAX_FS_FREE_HANDLES                      (65535U)
#define WINC_CMD_PARAM_MIN_FS_BYTES_REMAIN                      (1U)
#define WINC_CMD_PARAM_MAX_FS_BYTES_REMAIN                      (65535U)
#define WINC_CMD_PARAM_MIN_MQTT_MSG_ID                          (0U)
#define WINC_CMD_PARAM_MAX_MQTT_MSG_ID                          (65535U)
#define WINC_CMD_PARAM_MIN_MQTT_LENGTH                          (0U)
#define WINC_CMD_PARAM_MAX_MQTT_LENGTH                          (65535U)
#define WINC_CMD_PARAM_MIN_MQTT_REASON_CODE                     (0U)
#define WINC_CMD_PARAM_MAX_MQTT_REASON_CODE                     (255U)
#define WINC_CMD_PARAM_MIN_NETIF_INTF                           (0U)
#define WINC_CMD_PARAM_MAX_NETIF_INTF                           (1U)
#define WINC_CMD_PARAM_MIN_OTA_OTA_OP_ID                        (1U)
#define WINC_CMD_PARAM_MAX_OTA_OTA_OP_ID                        (255U)
#define WINC_CMD_PARAM_MIN_SOCKET_LCL_PORT                      (1U)
#define WINC_CMD_PARAM_MAX_SOCKET_LCL_PORT                      (65535U)
#define WINC_CMD_PARAM_MIN_SOCKET_RMT_PORT                      (1U)
#define WINC_CMD_PARAM_MAX_SOCKET_RMT_PORT                      (65535U)
#define WINC_CMD_PARAM_MIN_SOCKET_SOCK_ID                       (1U)
#define WINC_CMD_PARAM_MAX_SOCKET_SOCK_ID                       (65535U)
#define WINC_CMD_PARAM_MIN_SOCKET_PEND_SKTS                     (1U)
#define WINC_CMD_PARAM_MAX_SOCKET_PEND_SKTS                     (5U)
#define WINC_CMD_PARAM_MIN_SOCKET_LENGTH                        (0U)
#define WINC_CMD_PARAM_MAX_SOCKET_LENGTH                        (1460U)
#define WINC_CMD_PARAM_MIN_SOCKET_SEQ_NUM                       (0U)
#define WINC_CMD_PARAM_MAX_SOCKET_SEQ_NUM                       (65535U)
#define WINC_CMD_PARAM_MIN_SOCKET_MCAST_PORT                    (1U)
#define WINC_CMD_PARAM_MAX_SOCKET_MCAST_PORT                    (65535U)
#define WINC_CMD_PARAM_MIN_SOCKET_TLS_CONF                      (0U)
#define WINC_CMD_PARAM_MAX_SOCKET_TLS_CONF                      (2U)
#define WINC_CMD_PARAM_MIN_TIME_UTC_SEC                         (0U)
#define WINC_CMD_PARAM_MAX_TIME_UTC_SEC                         (4294967295U)
#define WINC_CMD_PARAM_MIN_TLS_CONF                             (1U)
#define WINC_CMD_PARAM_MAX_TLS_CONF                             (2U)
#define WINC_CMD_PARAM_MIN_TLS_CSL_IDX                          (1U)
#define WINC_CMD_PARAM_MAX_TLS_CSL_IDX                          (2U)
#define WINC_CMD_PARAM_MIN_ASSOC_ASSOC_ID                       (1U)
#define WINC_CMD_PARAM_MAX_ASSOC_ASSOC_ID                       (65535U)
#define WINC_CMD_PARAM_MIN_EXTCRYPTO_OP_ID                      (1U)
#define WINC_CMD_PARAM_MAX_EXTCRYPTO_OP_ID                      (65535U)
#define WINC_CMD_PARAM_MIN_EXTCRYPTO_OP_SOURCE_ID               (1U)
#define WINC_CMD_PARAM_MAX_EXTCRYPTO_OP_SOURCE_ID               (2U)
#define WINC_CMD_PARAM_MIN_NVM_SECTOR_OFFSET                    (0U)
#define WINC_CMD_PARAM_MAX_NVM_SECTOR_OFFSET                    (239U)
#define WINC_CMD_PARAM_MIN_NVM_OFFSET                           (0U)
#define WINC_CMD_PARAM_MAX_NVM_OFFSET                           (983039U)
#define WINC_CMD_PARAM_MIN_NVM_SECTORS                          (1U)
#define WINC_CMD_PARAM_MAX_NVM_SECTORS                          (240U)
#define WINC_CMD_PARAM_MIN_NVM_LENGTH                           (1U)
#define WINC_CMD_PARAM_MAX_NVM_LENGTH                           (1024U)
#define WINC_CMD_PARAM_MIN_NVM_DATA                             (1U)
#define WINC_CMD_PARAM_MAX_NVM_DATA                             (1024U)

#define WINC_CFG_PARAM_ID_CFG_DEVICE_NAME                       (1U)
#define WINC_CFG_PARAM_ID_CFG_VERSION                           (10U)
#define WINC_CFG_PARAM_ID_CFG_PATCH                             (11U)
#define WINC_CFG_PARAM_ID_CFG_SECURITY                          (12U)
#define WINC_CFG_PARAM_ID_CFG_BUILD_HASH                        (13U)
#define WINC_CFG_PARAM_ID_CFG_BUILD_TIME                        (14U)
#define WINC_CFG_PARAM_ID_CFG_ARCHIVE_FILTER                    (50U)
#define WINC_CFG_PARAM_ID_CFG_ARCHIVE_SLOTS                     (51U)
#define WINC_CFG_PARAM_ID_CFG_DEBUG_PORT                        (100U)
#define WINC_CFG_PARAM_ID_CFG_DEBUG_BAUD                        (101U)
#define WINC_CFG_PARAM_ID_DHCPS_ENABLED                         (1U)
#define WINC_CFG_PARAM_ID_DHCPS_POOL_START                      (2U)
#define WINC_CFG_PARAM_ID_DHCPS_POOL_END                        (3U)
#define WINC_CFG_PARAM_ID_DHCPS_POOL_LEASES                     (4U)
#define WINC_CFG_PARAM_ID_DHCPS_NETIF_IDX                       (5U)
#define WINC_CFG_PARAM_ID_DHCPS_GATEWAY                         (10U)
#define WINC_CFG_PARAM_ID_DHCPS_DNS_SVR                         (11U)
#define WINC_CFG_PARAM_ID_DNS_DNS_SVR                           (1U)
#define WINC_CFG_PARAM_ID_DNS_DNS_AUTO                          (2U)
#define WINC_CFG_PARAM_ID_DNS_DNS_TIMEOUT                       (3U)
#define WINC_CFG_PARAM_ID_DNS_DNS_PROTO_PREF                    (4U)
#define WINC_CFG_PARAM_ID_MQTT_BROKER_ADDR                      (1U)
#define WINC_CFG_PARAM_ID_MQTT_BROKER_PORT                      (2U)
#define WINC_CFG_PARAM_ID_MQTT_CLIENT_ID                        (3U)
#define WINC_CFG_PARAM_ID_MQTT_USERNAME                         (4U)
#define WINC_CFG_PARAM_ID_MQTT_PASSWORD                         (5U)
#define WINC_CFG_PARAM_ID_MQTT_KEEP_ALIVE                       (6U)
#define WINC_CFG_PARAM_ID_MQTT_TLS_CONF                         (7U)
#define WINC_CFG_PARAM_ID_MQTT_PROTO_VER                        (8U)
#define WINC_CFG_PARAM_ID_MQTT_READ_THRESHOLD                   (9U)
#define WINC_CFG_PARAM_ID_MQTTPROP_PAYLOAD_FORMAT_IND           (1U)
#define WINC_CFG_PARAM_ID_MQTTPROP_MSG_EXPIRY_INTERVAL          (2U)
#define WINC_CFG_PARAM_ID_MQTTPROP_CONTENT_TYPE                 (3U)
#define WINC_CFG_PARAM_ID_MQTTPROP_RESP_TOPIC                   (8U)
#define WINC_CFG_PARAM_ID_MQTTPROP_CORRELATION_DATA             (9U)
#define WINC_CFG_PARAM_ID_MQTTPROP_SUBSCRIPTION_ID              (11U)
#define WINC_CFG_PARAM_ID_MQTTPROP_SESSION_EXPIRY_INTERVAL      (17U)
#define WINC_CFG_PARAM_ID_MQTTPROP_ASSIGNED_CLIENT_ID           (18U)
#define WINC_CFG_PARAM_ID_MQTTPROP_SERVER_KEEP_ALIVE            (19U)
#define WINC_CFG_PARAM_ID_MQTTPROP_AUTH_METHOD                  (21U)
#define WINC_CFG_PARAM_ID_MQTTPROP_AUTH_DATA                    (22U)
#define WINC_CFG_PARAM_ID_MQTTPROP_REQ_PROB_INFO                (23U)
#define WINC_CFG_PARAM_ID_MQTTPROP_WILL_DELAY_INTERVAL          (24U)
#define WINC_CFG_PARAM_ID_MQTTPROP_REQ_RESP_INFO                (25U)
#define WINC_CFG_PARAM_ID_MQTTPROP_RESP_INFO                    (26U)
#define WINC_CFG_PARAM_ID_MQTTPROP_SERVER_REF                   (28U)
#define WINC_CFG_PARAM_ID_MQTTPROP_REASON_STR                   (31U)
#define WINC_CFG_PARAM_ID_MQTTPROP_RECEIVE_MAX                  (33U)
#define WINC_CFG_PARAM_ID_MQTTPROP_TOPIC_ALIAS_MAX              (34U)
#define WINC_CFG_PARAM_ID_MQTTPROP_TOPIC_ALIAS                  (35U)
#define WINC_CFG_PARAM_ID_MQTTPROP_MAX_QOS                      (36U)
#define WINC_CFG_PARAM_ID_MQTTPROP_RETAIN_AVAIL                 (37U)
#define WINC_CFG_PARAM_ID_MQTTPROP_USER_PROP                    (38U)
#define WINC_CFG_PARAM_ID_MQTTPROP_MAX_PACKET_SZ                (39U)
#define WINC_CFG_PARAM_ID_MQTTPROP_WILDCARD_SUB_AVAIL           (40U)
#define WINC_CFG_PARAM_ID_MQTTPROP_SUBSCRIPTION_ID_AVAIL        (41U)
#define WINC_CFG_PARAM_ID_MQTTPROP_SHARED_SUBSCRIPTION_AVAIL    (42U)
#define WINC_CFG_PARAM_ID_NETIF_NAME                            (1U)
#define WINC_CFG_PARAM_ID_NETIF_ETHER                           (2U)
#define WINC_CFG_PARAM_ID_NETIF_HOSTNAME                        (3U)
#define WINC_CFG_PARAM_ID_NETIF_DHCPC_EN                        (10U)
#define WINC_CFG_PARAM_ID_NETIF_DHCPC_LEASE_START               (11U)
#define WINC_CFG_PARAM_ID_NETIF_DHCPC_LEASE_ENDS                (12U)
#define WINC_CFG_PARAM_ID_NETIF_DHCPC_SRV_ADDR                  (13U)
#define WINC_CFG_PARAM_ID_NETIF_L2_ONLY                         (20U)
#define WINC_CFG_PARAM_ID_NETIF_L2_MONITOR_MODE                 (21U)
#define WINC_CFG_PARAM_ID_NETIF_L2_MONITOR_MAX_LEN              (22U)
#define WINC_CFG_PARAM_ID_NETIF_IP_MASK                         (40U)
#define WINC_CFG_PARAM_ID_NETIF_GATEWAY                         (41U)
#define WINC_CFG_PARAM_ID_NETIF_IPV6_GLO_ADDR                   (60U)
#define WINC_CFG_PARAM_ID_NETIF_IPV6_LL_ADDR                    (61U)
#define WINC_CFG_PARAM_ID_NETIF_IPV6_GATEWAY                    (62U)
#define WINC_CFG_PARAM_ID_OTA_PROTOCOL                          (1U)
#define WINC_CFG_PARAM_ID_OTA_HOST                              (2U)
#define WINC_CFG_PARAM_ID_OTA_PORT                              (3U)
#define WINC_CFG_PARAM_ID_OTA_PATH                              (4U)
#define WINC_CFG_PARAM_ID_OTA_FILE                              (5U)
#define WINC_CFG_PARAM_ID_OTA_TIMEOUT                           (6U)
#define WINC_CFG_PARAM_ID_OTA_TLS_CONF                          (7U)
#define WINC_CFG_PARAM_ID_SNTP_NTP_ENABLED                      (1U)
#define WINC_CFG_PARAM_ID_SNTP_NTP_STATIC                       (2U)
#define WINC_CFG_PARAM_ID_SNTP_NTP_SVR                          (3U)
#define WINC_CFG_PARAM_ID_SOCK_SO_LINGER                        (1U)
#define WINC_CFG_PARAM_ID_SOCK_SO_NODELAY                       (2U)
#define WINC_CFG_PARAM_ID_SOCK_SO_KEEPALIVE                     (3U)
#define WINC_CFG_PARAM_ID_SOCK_SO_RCVBUF                        (4U)
#define WINC_CFG_PARAM_ID_SOCK_SO_SNDBUF                        (5U)
#define WINC_CFG_PARAM_ID_SOCK_IP_TOS                           (32U)
#define WINC_CFG_PARAM_ID_SOCK_ASYNC_NEXT_SN                    (100U)
#define WINC_CFG_PARAM_ID_SOCK_ASYNC_WIN_SZ                     (101U)
#define WINC_CFG_PARAM_ID_SOCK_ASYNC_MAX_FRM_SZ                 (102U)
#define WINC_CFG_PARAM_ID_TLS_CTX_CA_CERT_NAME                  (1U)
#define WINC_CFG_PARAM_ID_TLS_CTX_CERT_NAME                     (2U)
#define WINC_CFG_PARAM_ID_TLS_CTX_PRI_KEY_NAME                  (3U)
#define WINC_CFG_PARAM_ID_TLS_CTX_PRI_KEY_PASSWORD              (4U)
#define WINC_CFG_PARAM_ID_TLS_CTX_SERVER_NAME                   (5U)
#define WINC_CFG_PARAM_ID_TLS_CTX_DOMAIN_NAME                   (6U)
#define WINC_CFG_PARAM_ID_TLS_CTX_CIPHER_SUITES_IDX             (7U)
#define WINC_CFG_PARAM_ID_TLS_CTX_DH_PARAM_NAME                 (8U)
#define WINC_CFG_PARAM_ID_TLS_CTX_EXTCRYPTO_OPS                 (20U)
#define WINC_CFG_PARAM_ID_TLS_CTX_SIGN_TYPES                    (21U)
#define WINC_CFG_PARAM_ID_TLS_CTX_PEER_AUTH                     (40U)
#define WINC_CFG_PARAM_ID_TLS_CTX_PEER_DOMAIN_VERIFY            (41U)
#define WINC_CFG_PARAM_ID_TLS_CSL_CIPHER_SUITES                 (1U)
#define WINC_CFG_PARAM_ID_TLS_CSL_CIPHER_SUITES_AVAIL           (2U)
#define WINC_CFG_PARAM_ID_WAP_SSID                              (1U)
#define WINC_CFG_PARAM_ID_WAP_SEC_TYPE                          (2U)
#define WINC_CFG_PARAM_ID_WAP_CREDENTIALS                       (3U)
#define WINC_CFG_PARAM_ID_WAP_CHANNEL                           (4U)
#define WINC_CFG_PARAM_ID_WAP_HIDDEN                            (5U)
#define WINC_CFG_PARAM_ID_WAP_NETIF_IDX                         (8U)
#define WINC_CFG_PARAM_ID_WAP_REKEY_INTERVAL                    (9U)
#define WINC_CFG_PARAM_ID_WAP_MFP_TYPE                          (50U)
#define WINC_CFG_PARAM_ID_WSCN_CHANNEL                          (1U)
#define WINC_CFG_PARAM_ID_WSCN_ACT_SLOT_TIME                    (2U)
#define WINC_CFG_PARAM_ID_WSCN_PASV_SLOT_TIME                   (3U)
#define WINC_CFG_PARAM_ID_WSCN_NUM_SLOTS                        (4U)
#define WINC_CFG_PARAM_ID_WSCN_PROBES_PER_SLOT                  (5U)
#define WINC_CFG_PARAM_ID_WSCN_RSSI_THRESH                      (6U)
#define WINC_CFG_PARAM_ID_WSCN_SEC_FILTER                       (7U)
#define WINC_CFG_PARAM_ID_WSCN_ASYNC_NOTIFY                     (8U)
#define WINC_CFG_PARAM_ID_WSCN_FILT_LIST                        (10U)
#define WINC_CFG_PARAM_ID_WSCN_CHANMASK24                       (11U)
#define WINC_CFG_PARAM_ID_WSCN_SCAN_RESULTS                     (20U)
#define WINC_CFG_PARAM_ID_WSTA_SSID                             (1U)
#define WINC_CFG_PARAM_ID_WSTA_SEC_TYPE                         (2U)
#define WINC_CFG_PARAM_ID_WSTA_CREDENTIALS                      (3U)
#define WINC_CFG_PARAM_ID_WSTA_CHANNEL                          (4U)
#define WINC_CFG_PARAM_ID_WSTA_BSSID                            (5U)
#define WINC_CFG_PARAM_ID_WSTA_CONN_TIMEOUT                     (7U)
#define WINC_CFG_PARAM_ID_WSTA_NETIF_IDX                        (8U)
#define WINC_CFG_PARAM_ID_WSTA_ROAMING                          (9U)
#define WINC_CFG_PARAM_ID_WSTA_TLS_CONF                         (20U)
#define WINC_CFG_PARAM_ID_WSTA_TLS_EAP_METHOD                   (21U)
#define WINC_CFG_PARAM_ID_WSTA_TLS_IDENT                        (22U)
#define WINC_CFG_PARAM_ID_WSTA_TLS_MSCHV2_UN                    (25U)
#define WINC_CFG_PARAM_ID_WSTA_TLS_MSCHV2_PW                    (26U)
#define WINC_CFG_PARAM_ID_WSTA_MFP_TYPE                         (50U)
#define WINC_CFG_PARAM_ID_WSTA_WPA3_TD                          (51U)
#define WINC_CFG_PARAM_ID_WPROV_PORT                            (1U)
#define WINC_CFG_PARAM_ID_WPROV_ASCII                           (2U)
#define WINC_CFG_PARAM_ID_WPROV_PROTOCOL_VERSION                (3U)
#define WINC_CFG_PARAM_ID_DI_DEVICE_ID                          (1U)
#define WINC_CFG_PARAM_ID_DI_NUM_IMAGES                         (14U)
#define WINC_CFG_PARAM_ID_DI_IMAGE_INFO                         (15U)
#define WINC_CFG_PARAM_ID_WIFI_REGDOMAIN_SELECTED               (10U)
#define WINC_CFG_PARAM_ID_WIFI_REGDOMAIN_AVAILABLE              (11U)
#define WINC_CFG_PARAM_ID_WIFI_REGDOMAIN_CHANMASK24             (12U)
#define WINC_CFG_PARAM_ID_WIFI_POWERSAVE                        (20U)
#define WINC_CFG_PARAM_ID_WIFI_COEX_ENABLED                     (30U)
#define WINC_CFG_PARAM_ID_WIFI_COEX_INTERFACE_TYPE              (31U)
#define WINC_CFG_PARAM_ID_WIFI_COEX_WLAN_RX_VS_BT               (32U)
#define WINC_CFG_PARAM_ID_WIFI_COEX_WLAN_TX_VS_BT               (33U)
#define WINC_CFG_PARAM_ID_WIFI_COEX_ANTENNA_MODE                (34U)
#define WINC_CFG_PARAM_ID_WIFI_AMPDU_TX_ENABLED                 (40U)
#define WINC_CFG_PARAM_ID_NVM_START_OFFSET                      (1U)
#define WINC_CFG_PARAM_ID_NVM_NUM_SECTORS                       (2U)
#define WINC_CFG_PARAM_ID_NVM_SECTOR_SZ                         (3U)
#define WINC_CFG_PARAM_ID_NVM_CHECK_MODE                        (4U)

