Microchip-MPLAB-Harmony/wireless_wifi/driver/wincs02/nc_driver/include/microchip_pic32mzw2_nc_intf.h
#define WINC_CFG_PARAM_SZ_CFG_DEVICE_NAME                       (32U)
#define WINC_CFG_PARAM_SZ_CFG_BUILD_HASH                        (5U)
#define WINC_CFG_PARAM_SZ_CFG_ARCHIVE_FILTER                    (32U)
#define WINC_CFG_PARAM_SZ_MQTT_BROKER_ADDR                      (64U)
#define WINC_CFG_PARAM_SZ_MQTT_CLIENT_ID                        (48U)
#define WINC_CFG_PARAM_SZ_MQTT_USERNAME                         (128U)
#define WINC_CFG_PARAM_SZ_MQTT_PASSWORD                         (256U)
#define WINC_CFG_PARAM_SZ_MQTTPROP_CONTENT_TYPE                 (16U)
#define WINC_CFG_PARAM_SZ_MQTTPROP_RESP_TOPIC                   (16U)
#define WINC_CFG_PARAM_SZ_MQTTPROP_CORRELATION_DATA             (16U)
#define WINC_CFG_PARAM_SZ_MQTTPROP_ASSIGNED_CLIENT_ID           (32U)
#define WINC_CFG_PARAM_SZ_MQTTPROP_RESP_INFO                    (16U)
#define WINC_CFG_PARAM_SZ_MQTTPROP_SERVER_REF                   (16U)
#define WINC_CFG_PARAM_SZ_MQTTPROP_REASON_STR                   (32U)
#define WINC_CFG_PARAM_SZ_NETIF_NAME                            (16U)
#define WINC_CFG_PARAM_SZ_NETIF_HOSTNAME                        (16U)
#define WINC_CFG_PARAM_SZ_OTA_HOST                              (255U)
#define WINC_CFG_PARAM_SZ_OTA_PATH                              (255U)
#define WINC_CFG_PARAM_SZ_OTA_FILE                              (64U)
#define WINC_CFG_PARAM_SZ_SNTP_NTP_SVR                          (128U)
#define WINC_CFG_PARAM_SZ_TLS_CTX_CA_CERT_NAME                  (32U)
#define WINC_CFG_PARAM_SZ_TLS_CTX_CERT_NAME                     (32U)
#define WINC_CFG_PARAM_SZ_TLS_CTX_PRI_KEY_NAME                  (32U)
#define WINC_CFG_PARAM_SZ_TLS_CTX_PRI_KEY_PASSWORD              (32U)
#define WINC_CFG_PARAM_SZ_TLS_CTX_SERVER_NAME                   (64U)
#define WINC_CFG_PARAM_SZ_TLS_CTX_DOMAIN_NAME                   (32U)
#define WINC_CFG_PARAM_SZ_TLS_CTX_DH_PARAM_NAME                 (32U)
#define WINC_CFG_PARAM_SZ_WAP_SSID                              (32U)
#define WINC_CFG_PARAM_SZ_WAP_CREDENTIALS                       (128U)
#define WINC_CFG_PARAM_SZ_WSTA_SSID                             (32U)
#define WINC_CFG_PARAM_SZ_WSTA_CREDENTIALS                      (128U)
#define WINC_CFG_PARAM_SZ_WIFI_REGDOMAIN_SELECTED               (6U)
#define WINC_CFG_PARAM_SZ_WIFI_REGDOMAIN_AVAILABLE              (6U)

#define WINC_CFG_PARAM_NUM_CFG_ARCHIVE_FILTER                   (8U)
#define WINC_CFG_PARAM_NUM_CFG_ARCHIVE_SLOTS                    (3U)
#define WINC_CFG_PARAM_NUM_DNS_DNS_SVR                          (2U)
#define WINC_CFG_PARAM_NUM_MQTTPROP_USER_PROP                   (10U)
#define WINC_CFG_PARAM_NUM_NETIF_IPV6_GLO_ADDR                  (2U)
#define WINC_CFG_PARAM_NUM_TLS_CSL_CIPHER_SUITES                (32U)
#define WINC_CFG_PARAM_NUM_TLS_CSL_CIPHER_SUITES_AVAIL          (32U)
#define WINC_CFG_PARAM_NUM_WSCN_FILT_LIST                       (4U)
#define WINC_CFG_PARAM_NUM_WSCN_SCAN_RESULTS                    (8U)
#define WINC_CFG_PARAM_NUM_DI_IMAGE_INFO                        (2U)
#define WINC_CFG_PARAM_NUM_WIFI_REGDOMAIN_AVAILABLE             (6U)

#define WINC_CFG_PARAM_MIN_DHCPS_POOL_LEASES                    (0)
#define WINC_CFG_PARAM_MAX_DHCPS_POOL_LEASES                    (0xFFFF)
#define WINC_CFG_PARAM_MIN_DHCPS_NETIF_IDX                      (0)
#define WINC_CFG_PARAM_MAX_DHCPS_NETIF_IDX                      (1)
#define WINC_CFG_PARAM_MIN_DNS_DNS_TIMEOUT                      (0U)
#define WINC_CFG_PARAM_MAX_DNS_DNS_TIMEOUT                      (0xFFFFU)
#define WINC_CFG_PARAM_MIN_MQTT_BROKER_PORT                     (0)
#define WINC_CFG_PARAM_MAX_MQTT_BROKER_PORT                     (0xFFFF)
#define WINC_CFG_PARAM_MIN_MQTT_KEEP_ALIVE                      (0)
#define WINC_CFG_PARAM_MAX_MQTT_KEEP_ALIVE                      (0x7FFF)
#define WINC_CFG_PARAM_MIN_MQTT_TLS_CONF                        (0)
#define WINC_CFG_PARAM_MAX_MQTT_TLS_CONF                        (2)
#define WINC_CFG_PARAM_MIN_MQTT_READ_THRESHOLD                  (0U)
#define WINC_CFG_PARAM_MAX_MQTT_READ_THRESHOLD                  (0xFFFFU)
#define WINC_CFG_PARAM_MIN_MQTTPROP_RECEIVE_MAX                 (0U)
#define WINC_CFG_PARAM_MAX_MQTTPROP_RECEIVE_MAX                 (0xFFFFU)
#define WINC_CFG_PARAM_MIN_MQTTPROP_TOPIC_ALIAS_MAX             (0U)
#define WINC_CFG_PARAM_MAX_MQTTPROP_TOPIC_ALIAS_MAX             (0xFFFFU)
#define WINC_CFG_PARAM_MIN_MQTTPROP_TOPIC_ALIAS                 (0U)
#define WINC_CFG_PARAM_MAX_MQTTPROP_TOPIC_ALIAS                 (0xFFFFU)
#define WINC_CFG_PARAM_MIN_MQTTPROP_MAX_QOS                     (0U)
#define WINC_CFG_PARAM_MAX_MQTTPROP_MAX_QOS                     (2U)
#define WINC_CFG_PARAM_MIN_OTA_TIMEOUT                          (1U)
#define WINC_CFG_PARAM_MAX_OTA_TIMEOUT                          (0x00FFU)
#define WINC_CFG_PARAM_MIN_OTA_TLS_CONF                         (0)
#define WINC_CFG_PARAM_MAX_OTA_TLS_CONF                         (2)
#define WINC_CFG_PARAM_MIN_SOCK_SO_KEEPALIVE                    (0U)
#define WINC_CFG_PARAM_MAX_SOCK_SO_KEEPALIVE                    (0xFFFFU)
#define WINC_CFG_PARAM_MIN_SOCK_SO_RCVBUF                       (1460U)
#define WINC_CFG_PARAM_MAX_SOCK_SO_RCVBUF                       (32768U)
#define WINC_CFG_PARAM_MIN_SOCK_SO_SNDBUF                       (1460U)
#define WINC_CFG_PARAM_MAX_SOCK_SO_SNDBUF                       (32768U)
#define WINC_CFG_PARAM_MIN_TLS_CTX_CIPHER_SUITES_IDX            (1)
#define WINC_CFG_PARAM_MAX_TLS_CTX_CIPHER_SUITES_IDX            (2)
#define WINC_CFG_PARAM_MIN_TLS_CSL_CIPHER_SUITES                (1U)
#define WINC_CFG_PARAM_MAX_TLS_CSL_CIPHER_SUITES                (0xFFFFU)
#define WINC_CFG_PARAM_MIN_TLS_CSL_CIPHER_SUITES_AVAIL          (1U)
#define WINC_CFG_PARAM_MAX_TLS_CSL_CIPHER_SUITES_AVAIL          (0xFFFFU)
#define WINC_CFG_PARAM_MIN_WAP_CHANNEL                          (1)
#define WINC_CFG_PARAM_MAX_WAP_CHANNEL                          (13)
#define WINC_CFG_PARAM_MIN_WAP_NETIF_IDX                        (0U)
#define WINC_CFG_PARAM_MAX_WAP_NETIF_IDX                        (1U)
#define WINC_CFG_PARAM_MIN_WAP_REKEY_INTERVAL                   (60U)
#define WINC_CFG_PARAM_MAX_WAP_REKEY_INTERVAL                   (86400U)
#define WINC_CFG_PARAM_MIN_WSCN_CHANNEL                         (1U)
#define WINC_CFG_PARAM_MAX_WSCN_CHANNEL                         (13U)
#define WINC_CFG_PARAM_MIN_WSCN_ACT_SLOT_TIME                   (0U)
#define WINC_CFG_PARAM_MAX_WSCN_ACT_SLOT_TIME                   (0xFFFFU)
#define WINC_CFG_PARAM_MIN_WSCN_PASV_SLOT_TIME                  (0U)
#define WINC_CFG_PARAM_MAX_WSCN_PASV_SLOT_TIME                  (0xFFFFU)
#define WINC_CFG_PARAM_MIN_WSCN_NUM_SLOTS                       (0U)
#define WINC_CFG_PARAM_MAX_WSCN_NUM_SLOTS                       (0x00FFU)
#define WINC_CFG_PARAM_MIN_WSCN_PROBES_PER_SLOT                 (0U)
#define WINC_CFG_PARAM_MAX_WSCN_PROBES_PER_SLOT                 (0x00FFU)
#define WINC_CFG_PARAM_MIN_WSCN_RSSI_THRESH                     (-128)
#define WINC_CFG_PARAM_MAX_WSCN_RSSI_THRESH                     (0x007F)
#define WINC_CFG_PARAM_MIN_WSTA_CHANNEL                         (0)
#define WINC_CFG_PARAM_MAX_WSTA_CHANNEL                         (13)
#define WINC_CFG_PARAM_MIN_WSTA_CONN_TIMEOUT                    (0)
#define WINC_CFG_PARAM_MAX_WSTA_CONN_TIMEOUT                    (0x7FFFFFFF)
#define WINC_CFG_PARAM_MIN_WSTA_NETIF_IDX                       (0U)
#define WINC_CFG_PARAM_MAX_WSTA_NETIF_IDX                       (1U)
#define WINC_CFG_PARAM_MIN_WPROV_PORT                           (1U)
#define WINC_CFG_PARAM_MAX_WPROV_PORT                           (0xFFFFU)

#define WINC_CFG_PARAM_OPT_CFG_DEBUG_PORT_OFF                   (0U)
#define WINC_CFG_PARAM_OPT_CFG_DEBUG_PORT_UART1                 (1U)
#define WINC_CFG_PARAM_OPT_CFG_DEBUG_PORT_UART2                 (2U)
#define WINC_CFG_PARAM_OPT_DNS_DNS_PROTO_PREF_NO_REC            (0U)
#define WINC_CFG_PARAM_OPT_DNS_DNS_PROTO_PREF_A_AAAA            (1U)
#define WINC_CFG_PARAM_OPT_DNS_DNS_PROTO_PREF_AAAA_A            (2U)
#define WINC_CFG_PARAM_OPT_DNS_DNS_PROTO_PREF_A                 (3U)
#define WINC_CFG_PARAM_OPT_DNS_DNS_PROTO_PREF_AAAA              (4U)
#define WINC_CFG_PARAM_OPT_MQTT_PROTO_VER_V3_1_1                (3U)
#define WINC_CFG_PARAM_OPT_MQTT_PROTO_VER_V5                    (5U)
#define WINC_CFG_PARAM_OPT_NETIF_L2_MONITOR_MODE_OFF            (0U)
#define WINC_CFG_PARAM_OPT_NETIF_L2_MONITOR_MODE_UNICAST        (1U)
#define WINC_CFG_PARAM_OPT_NETIF_L2_MONITOR_MODE_BCAST          (2U)
#define WINC_CFG_PARAM_OPT_NETIF_L2_MONITOR_MODE_UNI_BCAST      (3U)
#define WINC_CFG_PARAM_OPT_NETIF_L2_MONITOR_MODE_MCAST          (4U)
#define WINC_CFG_PARAM_OPT_NETIF_L2_MONITOR_MODE_UNI_MCAST      (5U)
#define WINC_CFG_PARAM_OPT_NETIF_L2_MONITOR_MODE_B_MCAST        (6U)
#define WINC_CFG_PARAM_OPT_NETIF_L2_MONITOR_MODE_UNI_B_MCAST    (7U)
#define WINC_CFG_PARAM_OPT_OTA_PROTOCOL_HTTP                    (1U)
#define WINC_CFG_PARAM_OPT_SOCK_IP_TOS_NORM                     (0x00U)
#define WINC_CFG_PARAM_OPT_SOCK_IP_TOS_REL                      (0x04U)
#define WINC_CFG_PARAM_OPT_SOCK_IP_TOS_THRPUT                   (0x08U)
#define WINC_CFG_PARAM_OPT_SOCK_IP_TOS_LOW_DELAY                (0x10U)
#define WINC_CFG_PARAM_OPT_TLS_CTX_EXTCRYPTO_OPS_NONE           (0U)
#define WINC_CFG_PARAM_OPT_TLS_CTX_EXTCRYPTO_OPS_SIGN           (1U)
#define WINC_CFG_PARAM_OPT_TLS_CTX_SIGN_TYPES_ECDSA             (1U)
#define WINC_CFG_PARAM_OPT_WAP_SEC_TYPE_OPEN                    (0U)
#define WINC_CFG_PARAM_OPT_WAP_SEC_TYPE_WPA2_PERS_MIXED         (2U)
#define WINC_CFG_PARAM_OPT_WAP_SEC_TYPE_WPA2_PERS               (3U)
#define WINC_CFG_PARAM_OPT_WAP_SEC_TYPE_WPA3_PERS_TRANS         (4U)
#define WINC_CFG_PARAM_OPT_WAP_SEC_TYPE_WPA3_PERS               (5U)
#define WINC_CFG_PARAM_OPT_WAP_MFP_TYPE_DISABLED                (0U)
#define WINC_CFG_PARAM_OPT_WAP_MFP_TYPE_ENABLED                 (1U)
#define WINC_CFG_PARAM_OPT_WAP_MFP_TYPE_REQUIRED                (2U)
#define WINC_CFG_PARAM_OPT_WSCN_SEC_FILTER_PERS                 (0x01U)
#define WINC_CFG_PARAM_OPT_WSCN_SEC_FILTER_ENT                  (0x02U)
#define WINC_CFG_PARAM_OPT_WSCN_SEC_FILTER_OPEN                 (0x04U)
#define WINC_CFG_PARAM_OPT_WSCN_SEC_FILTER_WEP                  (0x08U)
#define WINC_CFG_PARAM_OPT_WSCN_SEC_FILTER_WPA                  (0x10U)
#define WINC_CFG_PARAM_OPT_WSCN_SEC_FILTER_WPA2                 (0x20U)
#define WINC_CFG_PARAM_OPT_WSCN_SEC_FILTER_WPA3                 (0x40U)
#define WINC_CFG_PARAM_OPT_WSCN_CHANMASK24_CH1                  (0x0001U)
#define WINC_CFG_PARAM_OPT_WSCN_CHANMASK24_CH2                  (0x0002U)
#define WINC_CFG_PARAM_OPT_WSCN_CHANMASK24_CH3                  (0x0004U)
#define WINC_CFG_PARAM_OPT_WSCN_CHANMASK24_CH4                  (0x0008U)
#define WINC_CFG_PARAM_OPT_WSCN_CHANMASK24_CH5                  (0x0010U)
#define WINC_CFG_PARAM_OPT_WSCN_CHANMASK24_CH6                  (0x0020U)
#define WINC_CFG_PARAM_OPT_WSCN_CHANMASK24_CH7                  (0x0040U)
#define WINC_CFG_PARAM_OPT_WSCN_CHANMASK24_CH8                  (0x0080U)
#define WINC_CFG_PARAM_OPT_WSCN_CHANMASK24_CH9                  (0x0100U)
#define WINC_CFG_PARAM_OPT_WSCN_CHANMASK24_CH10                 (0x0200U)
#define WINC_CFG_PARAM_OPT_WSCN_CHANMASK24_CH11                 (0x0400U)
#define WINC_CFG_PARAM_OPT_WSCN_CHANMASK24_CH12                 (0x0800U)
#define WINC_CFG_PARAM_OPT_WSCN_CHANMASK24_CH13                 (0x1000U)
#define WINC_CFG_PARAM_OPT_WSCN_CHANMASK24_CH14                 (0x2000U)
#define WINC_CFG_PARAM_OPT_WSTA_SEC_TYPE_OPEN                   (0U)
#define WINC_CFG_PARAM_OPT_WSTA_SEC_TYPE_WPA2_PERS_MIXED        (2U)
#define WINC_CFG_PARAM_OPT_WSTA_SEC_TYPE_WPA2_PERS_             (3U)
#define WINC_CFG_PARAM_OPT_WSTA_SEC_TYPE_WPA3_PERS_TRANS        (4U)
#define WINC_CFG_PARAM_OPT_WSTA_SEC_TYPE_WPA3_PERS              (5U)
#define WINC_CFG_PARAM_OPT_WSTA_SEC_TYPE_WPA2_ENT_MIXED         (6U)
#define WINC_CFG_PARAM_OPT_WSTA_SEC_TYPE_WPA2_ENT               (7U)
#define WINC_CFG_PARAM_OPT_WSTA_SEC_TYPE_WPA3_ENT_TRANS         (8U)
#define WINC_CFG_PARAM_OPT_WSTA_SEC_TYPE_WPA3_ENT               (9U)
#define WINC_CFG_PARAM_OPT_WSTA_ROAMING_DISABLED                (0U)
#define WINC_CFG_PARAM_OPT_WSTA_ROAMING_WIFI                    (1U)
#define WINC_CFG_PARAM_OPT_WSTA_ROAMING_LAYER3                  (2U)
#define WINC_CFG_PARAM_OPT_WSTA_MFP_TYPE_DISABLED               (0U)
#define WINC_CFG_PARAM_OPT_WSTA_MFP_TYPE_ENABLED                (1U)
#define WINC_CFG_PARAM_OPT_WSTA_MFP_TYPE_REQUIRED               (2U)
#define WINC_CFG_PARAM_OPT_WPROV_PROTOCOL_VERSION_IPV4          (4U)
#define WINC_CFG_PARAM_OPT_WPROV_PROTOCOL_VERSION_IPV6          (6U)
#define WINC_CFG_PARAM_OPT_WIFI_REGDOMAIN_CHANMASK24_CH1        (0x0001U)
#define WINC_CFG_PARAM_OPT_WIFI_REGDOMAIN_CHANMASK24_CH2        (0x0002U)
#define WINC_CFG_PARAM_OPT_WIFI_REGDOMAIN_CHANMASK24_CH3        (0x0004U)
#define WINC_CFG_PARAM_OPT_WIFI_REGDOMAIN_CHANMASK24_CH4        (0x0008U)
#define WINC_CFG_PARAM_OPT_WIFI_REGDOMAIN_CHANMASK24_CH5        (0x0010U)
#define WINC_CFG_PARAM_OPT_WIFI_REGDOMAIN_CHANMASK24_CH6        (0x0020U)
#define WINC_CFG_PARAM_OPT_WIFI_REGDOMAIN_CHANMASK24_CH7        (0x0040U)
#define WINC_CFG_PARAM_OPT_WIFI_REGDOMAIN_CHANMASK24_CH8        (0x0080U)
#define WINC_CFG_PARAM_OPT_WIFI_REGDOMAIN_CHANMASK24_CH9        (0x0100U)
#define WINC_CFG_PARAM_OPT_WIFI_REGDOMAIN_CHANMASK24_CH10       (0x0200U)
#define WINC_CFG_PARAM_OPT_WIFI_REGDOMAIN_CHANMASK24_CH11       (0x0400U)
#define WINC_CFG_PARAM_OPT_WIFI_REGDOMAIN_CHANMASK24_CH12       (0x0800U)
#define WINC_CFG_PARAM_OPT_WIFI_REGDOMAIN_CHANMASK24_CH13       (0x1000U)
#define WINC_CFG_PARAM_OPT_WIFI_REGDOMAIN_CHANMASK24_CH14       (0x2000U)
#define WINC_CFG_PARAM_OPT_NVM_CHECK_MODE_CRC16                 (2U)
#define WINC_CFG_PARAM_OPT_NVM_CHECK_MODE_SHA                   (10U)
#define WINC_CFG_PARAM_OPT_NVM_CHECK_MODE_SHA256                (11U)
#define WINC_CFG_PARAM_OPT_NVM_CHECK_MODE_SHA224                (12U)
#define WINC_CFG_PARAM_OPT_NVM_CHECK_MODE_SHA512                (13U)
#define WINC_CFG_PARAM_OPT_NVM_CHECK_MODE_SHA384                (14U)

#define WINC_CMD_PARAM_SZ_DNS_DOMAIN_NAME                       (128U)
#define WINC_CMD_PARAM_SZ_FS_FILENAME                           (32U)
#define WINC_CMD_PARAM_SZ_SOCKET_DATA_WR                        (1460U)
#define WINC_CMD_PARAM_SZ_SOCKET_DATA_WRTO                      (1472U)

