Microchip-MPLAB-Harmony/wireless_wifi/driver/wincs02/nc_driver/include/microchip_pic32mzw2_nc_intf.h
typedef enum
{
    WINC_TYPE_INVALID                = 0,

    /* STATUS: 2 bytes: <MODULE_ID> | <MSG_ID>. */
    WINC_TYPE_STATUS                 = 1,

    /* INTEGER: 1 to 4 bytes: MSB first (big-endian). */
    WINC_TYPE_INTEGER                = 2,

    /* INTEGER_UNSIGNED: 1 to 4 bytes: MSB first (big-endian). */
    WINC_TYPE_INTEGER_UNSIGNED       = 3,

    /* INTEGER_FRAC: 4 bytes: 2 byte integer part followed by 2 byte fractional part (big-endian). */
    WINC_TYPE_INTEGER_FRAC           = 4,

    /* STRING: ASCII bytes, no termination. */
    WINC_TYPE_STRING                 = 5,

    /* BYTE_ARRAY: Unformatted array of bytes. */
    WINC_TYPE_BYTE_ARRAY             = 6,

    /* LABEL: Alphanumeric bytes. */
    WINC_TYPE_LABEL                  = 7,

    /* IPV4ADDR:
       4 bytes: MSB first IPv4 address A1|A2|A3|A4 = A1.A2.A3.A4
       8 bytes: MSB first IPv4 address and netmask A1|A2|A3|A4|M1|M2|M3|M4 = A1.A2.A3.A4 + M1.M2.M3.M4 */
    WINC_TYPE_IPV4ADDR               = 8,

    /* IPV6ADDR:
       16 bytes: MSB first IPv6 address A1|...|A16 = A1A2::A15A16
       17 bytes: MSB first IPv6 address and scope A1|...|A16 | M1 = A1A2::A15A16/M1 */
    WINC_TYPE_IPV6ADDR               = 9,

    /* BOOL: Single byte: 0 or 1. */
    WINC_TYPE_BOOL                   = 10,

    /* MACADDR: 6 bytes: MSB first MAC address A1|...|A6 = A1:A2:A3:A4:A5:A6. */
    WINC_TYPE_MACADDR                = 11,

    /* UTC_TIME: 4 bytes: MSB first UTC seconds. */
    WINC_TYPE_UTC_TIME               = 12,
} WINC_TYPE;

typedef enum
{
    /* REQ: <COMMAND_REQUEST> followed by [N*<TLV_ELEMENT>] parameters. */
    WINC_COMMAND_MSG_TYPE_REQ        = 0,

    /* STATUS: <COMMAND_RESPONSE> with <COMMAND_RSP_STATUS> option. */
    WINC_COMMAND_MSG_TYPE_STATUS     = 1,

    /* RSP: <COMMAND_RESPONSE> with <COMMAND_RSP_DATA> option containing [N, N*<TLV_ELEMENT>] elements. */
    WINC_COMMAND_MSG_TYPE_RSP        = 2,

    /* AEC: <COMMAND_RESPONSE> with <COMMAND_RSP_DATA> option containing [N, N*<TLV_ELEMENT>] elements. */
    WINC_COMMAND_MSG_TYPE_AEC        = 3,
} WINC_COMMAND_MSG_TYPE;


/* : TLV flags, an 8-bit bitmask = | x x x x | base base | pad pad |. */
typedef enum
{
    /* PAD0: 0 byte padding. */
    WINC_TLV_FLAGS_PAD0          = 0,

    /* PAD1: 1 byte padding. */
    WINC_TLV_FLAGS_PAD1          = 1,

    /* PAD2: 2 byte padding. */
    WINC_TLV_FLAGS_PAD2          = 2,

    /* PAD3: 3 byte padding. */
    WINC_TLV_FLAGS_PAD3          = 3,

    /* PAD_MASK: Padding mask. */
    WINC_TLV_FLAGS_PAD_MASK      = 3,

    /* PAD_SHIFT: Padding shift, value are '(flags >> PAD_SHIFT) & PAD_MASK'. */
    WINC_TLV_FLAGS_PAD_SHIFT     = 0,

    /* BASE10: Base 10 (decimal). */
    WINC_TLV_FLAGS_BASE10        = 0,

    /* BASE16: Base 16 (hexadecimal). */
    WINC_TLV_FLAGS_BASE16        = 1,

    /* BASE2: Base 2 (binary). */
    WINC_TLV_FLAGS_BASE2         = 2,

    /* BASE8: Base 8 (octal). */
    WINC_TLV_FLAGS_BASE8         = 3,

    /* BASE_MASK: Base mask. */
    WINC_TLV_FLAGS_BASE_MASK     = 3,

    /* BASE_SHIFT: Base shift, value are '(flags >> BASE_SHIFT) & BASE_MASK'. */
    WINC_TLV_FLAGS_BASE_SHIFT    = 2,
} WINC_TLV_FLAGS;

typedef struct
{
    uint8_t  type;                               // WINC_TYPE
    uint8_t  flags;
    uint8_t  length_h;                           // uint16_t (high byte)
    uint8_t  length_l;                           // uint16_t (low byte)
    uint8_t  data[];
} WINC_TLV_ELEMENT;

typedef struct
{
    uint8_t  numTlvs;
    uint8_t  tlvs[];                             // WINC_TLV_ELEMENT
} WINC_RSP_ELEMENTS;

typedef struct
{
    uint8_t  msgType;                            // WINC_COMMAND_MSG_TYPE
    uint8_t  id_h;                               // uint16_t (high byte)
    uint8_t  id_l;                               // uint16_t (low byte)
    uint8_t  seqNum_h;                           // uint16_t (high byte)
    uint8_t  seqNum_l;                           // uint16_t (low byte)
    uint8_t  numParams;
    uint8_t  length_h;                           // uint16_t (high byte)
    uint8_t  length_l;                           // uint16_t (low byte)
    uint8_t  params[];                           // WINC_TLV_ELEMENT
} WINC_COMMAND_REQUEST;

typedef struct
{
    uint8_t  msgType;                            // WINC_COMMAND_MSG_TYPE
    uint8_t  id_h;                               // uint16_t (high byte)
    uint8_t  id_l;                               // uint16_t (low byte)
    uint8_t  seqNum_h;                           // uint16_t (high byte)
    uint8_t  seqNum_l;                           // uint16_t (low byte)
    union
    {
        // WINC_COMMAND_RSP_DATA
        struct
        {
            uint8_t  rspId_h;                    // uint16_t (high byte)
            uint8_t  rspId_l;                    // uint16_t (low byte)
            uint8_t  length_h;                   // uint16_t (high byte)
            uint8_t  length_l;                   // uint16_t (low byte)
            uint8_t  elements[];                 // WINC_RSP_ELEMENTS
        } rsp;

        // WINC_COMMAND_RSP_STATUS
        struct
        {
            uint8_t  status_h;                   // uint16_t (high byte)
            uint8_t  status_l;                   // uint16_t (low byte)
        } status;

    } payload;
} WINC_COMMAND_RESPONSE;

#endif /* MICROCHIP_PIC32MZW2_NC_INTF_H */
